# целевая функция
# 𝑓(𝑥1, 𝑥2) = 2(𝑥1)^2 + 5(𝑥2)^2 + (𝑥1)(𝑥2) − 3(𝑥1) − (𝑥2)

from math import sqrt


e = 0.001   # точность
a = 0.001   # шаг
x1, x2 = 1, 1   # начальная точка


def f(x1, x2):
    '''целевая функция'''
    return 2*(x1^2) + 5*(x2^2) + (x1)*(x2) - 3*(x1) - (x2)

def df_dx1(x1, x2):
    '''производная по первому аргументу'''
    return 4(x1) + (x2) - 3

def df_dx2(x1, x2):
    '''производная по второму аргументу'''
    return 10(x2) + (x1) - 1

def grad_slope():
    '''метод градиентного спуска'''
    # точность не достигнута
    while sqrt(df_dx1(x1, x2)^2 + df_dx2(x1, x2)^2) > e:
        z1 = x1 - a*(df_dx1(x1, x2))
        z2 = x2 - a*(df_dx2(x1, x2))
        fz = f(z1, z2)
        fx = f(x1, x2)
        if fz > fx:
            x1, x2 = z1, z2
        else:
            a = a/2
    
    # точность достигнута
    print(f'X*: {x1}; {x2}' \
          f'f*: {f(x1, x2)}')


